# ConnectionValidationInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionValidationInfo Members
ConnectionValidationInfo Class Constructors Methods Properties See Also
---
The ConnectionValidationInfo type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectionValidationInfo | Constructor. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ConnectionValidationInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWarning | Access specific warning number of warnings generated by reload. |
| IsValidWarningIndex | Validate warning index. |
| ManyWarnings | Returns number of warnings generated by reload. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace